const dict = {
  type: {
    '': '全部分类',
    '1': '建议',
    '2': '诉求',
    '3': '举报',
    '4': '咨询',
    '5': '其他'
  },
  _type: [
    { id: '', value: '全部分类' },
    { id: 1, value: '建议' },
    { id: 2, value: '诉求' },
    { id: 3, value: '举报' },
    { id: 4, value: '咨询' },
    { id: 5, value: '其他' }
  ],
  status: {
    '': '全部状态',
    '1': '已撤回',
    '2': '未通过',
    '3': '未回复',
    '5': '已受理',
    '6': '审核回复'
  },
  _status: [
    { id: '', value: '全部状态' },
    { id: 1, value: '已撤回' },
    { id: 2, value: '未通过' },
    { id: 3, value: '未回复' },
    { id: 4, value: '已受理' },
    { id: 5, value: '审核回复' }
  ],
  domain: {
    '': '全部领域',
    '1': '住建',
    '2': '公安',
    '3': '交通运输',
    '4': '教育',
    '5': '民政',
    '6': '人社',
    '7': '医疗保障',
    '8': '卫生健康',
    '9': '生态环境',
    '10': '市场监管',
    '11': '农业农村',
    '12': '城管',
    '13': '财政税收',
    '14': '电力',
    '15': '物价',
    '16': '通信',
    '17': '商务',
    '18': '水利',
    '19': '自然资源',
    '20': '司法',
    '21': '金融',
    '22': '其他'
  },
  _domain: [
    { id: '', value: '全部领域' },
    { id: 1, value: '住建' },
    { id: 2, value: '公安' },
    { id: 3, value: '交通运输' },
    { id: 4, value: '教育' },
    { id: 5, value: '民政' },
    { id: 6, value: '人社' },
    { id: 7, value: '医疗保障' },
    { id: 8, value: '卫生健康' },
    { id: 9, value: '生态环境' },
    { id: 10, value: '市场监管' },
    { id: 11, value: '农业农村' },
    { id: 12, value: '城管' },
    { id: 13, value: '财政税收' },
    { id: 14, value: '电力' },
    { id: 15, value: '物价' },
    { id: 16, value: '通信' },
    { id: 17, value: '商务' },
    { id: 18, value: '水利' },
    { id: 19, value: '自然资源' },
    { id: 20, value: '司法' },
    { id: 21, value: '金融' },
    { id: 22, value: '其他' }
  ],
  appraise: {
    '1': '非常满意',
    '2': '满意',
    '3': '基本满意',
    '4': '不满意'
  },
  deptType: {
    '0': '国家',
    '1': '省级',
    '2': '市级',
    '3': '县级',
    '4': '乡镇',
    '5': '村级'
  },
  deptClassify: {
    '0': '全部',
    '1': '市级单位',
    '2': '县市区'
  }
}
export default dict
