const state = {
  linkReg:
    /^(?:http(s)?:\/\/)?[\w.-]+(?:\.[\w\.-]+)+[\w\-\._~:/?#[\]@!\$&'\*\+,;=.]+$/, // 校验链接地址
  nicknameReg: /^[a-zA-Z\u4e00-\u9fa5]{1,6}$/, // 昵称正则校验
  sqlReg: /select|update|delete|exec|count|'|"|=|;|>|<|%/, // 特殊符号正则校验
  mobileReg: /^0?1[3|4|5|8|7|9|6][0-9]\d{8}$/, // 手机号正则校验
  telReg: /^(([0\+]\d{2,3}-)?(0\d{2,3})-)?(\d{7,8})(-(\d{3,}))?$/, // 座机号正则校验
  emailReg: /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/, // 邮箱正则校验
  passwordReg:
    /^(?![A-Za-z0-9]+$)(?![a-z0-9#?!@$^&*-.]+$)(?![A-Za-z#?!@$^&*-.]+$)(?![A-Z0-9#?!@$^&*-.]+$)[a-zA-Z0-9#?!@$^&*-.]{9,16}$/, // 密码正则校验
  idCardReg: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/, // 身份证校验
  pwdReg:
    /^(?![A-Za-z0-9]+$)(?![a-z0-9#?!@$^&*-.]+$)(?![A-Za-z#?!@$^&*-.]+$)(?![A-Z0-9#?!@$^&*-.]+$)[a-zA-Z0-9#?!@$^&*-.]{9,16}$/ // 校验密码
}

export default {
  state
}
